// app/auth/constants.ts
export const OCCUPATIONS = [
	{
	  category: "경영·사무",
	  jobs: ["기획·전략", "총무·법무", "인사·노무", "회계·재무", "마케팅·홍보", "사무직"]
	},
	{
	  category: "IT·개발",
	  jobs: ["백엔드 개발", "프론트엔드 개발", "모바일 개발", "데이터 엔지니어", "보안", "시스템 엔지니어"]
	},
	{
	  category: "연구·교육",
	  jobs: ["연구원", "교수", "교사", "강사", "교육기획"]
	},
	{
	  category: "의료·보건",
	  jobs: ["의사", "간호사", "약사", "의료기사", "보건직"]
	},
	{
	  category: "제조·생산",
	  jobs: ["생산관리", "품질관리", "기계·설비", "전기·전자"]
	},
	{
	  category: "서비스",
	  jobs: ["영업·판매", "고객서비스", "미용·예술", "요식업"]
	},
	{
	  category: "건설·부동산",
	  jobs: ["건축·토목", "부동산", "시설관리"]
	},
	{
	  category: "기타",
	  jobs: ["학생", "주부", "프리랜서", "은퇴자", "무직"]
	}
  ];
  
  export const LOCATIONS = {
	"서울특별시": ["강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"],
	"부산광역시": ["강서구", "금정구", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구"],
	"대구광역시": ["남구", "달서구", "동구", "북구", "서구", "수성구", "중구"],
	"인천광역시": ["계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "중구"],
	"광주광역시": ["광산구", "남구", "동구", "북구", "서구"],
	"대전광역시": ["대덕구", "동구", "서구", "유성구", "중구"],
	"울산광역시": ["남구", "동구", "북구", "중구", "울주군"],
	"세종특별자치시": ["전체"],
	"경기도": ["고양시", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시", "안양시", "양주시", "오산시", "용인시", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"],
	"강원도": ["강릉시", "동해시", "삼척시", "속초시", "원주시", "춘천시", "태백시"],
	"충청북도": ["제천시", "청주시", "충주시"],
	"충청남도": ["계룡시", "공주시", "논산시", "당진시", "보령시", "서산시", "아산시", "천안시"],
	"전라북도": ["군산시", "김제시", "남원시", "익산시", "전주시", "정읍시"],
	"전라남도": ["광양시", "나주시", "목포시", "순천시", "여수시"],
	"경상북도": ["경산시", "경주시", "구미시", "김천시", "문경시", "상주시", "안동시", "영주시", "영천시", "포항시"],
	"경상남도": ["거제시", "김해시", "밀양시", "사천시", "양산시", "진주시", "창원시", "통영시"],
	"제주특별자치도": ["제주시", "서귀포시"],
	"해외": ["기타 국가"]
  };